[
    "Asani, the severe cyclonic storm in the Bay of Bengal, packing gale force winds up to 120 km per hour, was moving towards coastal Andhra Pradesh and Odisha at a speed of 25 km per hour on Monday, but expected to weaken gradually.",
    "The leader of banned organisation Sikhs for Justice has been named as the main accused in connection with the appearance of 'Khalistan' banners and graffiti on the walls of Himachal Pradesh Assembly in Dharamshala yesterday.",
    "The Suheldev Bharatiya Samaj Party (SBSP) national president Om Prakash Rajbhar on Sunday said the Opposition parties will form a huge alliance to defeat the Bharatiya Janata Party (BJP)-led alliance in the 2024 Lok Sabha election.",
    "Prime Minister Narendra Modi on Monday condoled the death of nine people who were killed in a road accident in Kamareddy district of Telangana and announced an ex-gratia of Rs 2 lakh each to the next of relativesof the dead.",
    "IndiGo is facing a massive backlash for not allowing a child with special needs to board from the Ranchi airport over the weekend.",
    "Union Home Minister Amit Shah is in Assam on a three-day visit, during which he will attend the Himanta Biswa Sarma-led government's first anniversary celebrations, and travel to the India-Bangladesh border.",
    "Prime Minister Narendra Modi on Monday paid tributes to Rabindranath Tagore on his birth anniversary, saying he continues to inspire millions of people in thought and action.",
    "Union Finance Minister Nirmala Sitharaman garnered praise on social media for offering water to the Managing Director of National Securities Depository Limited (NSDL), Padmaja Chunduru, who was giving a speech during an event in Mumbai.",
    "India logged 3,207 new coronavirus infections taking the total tally of COVID-19 cases to 4,31,05,401, while the active cases dipped to 20,403, according to the Union Health Ministry data updated on Monday.",
    "An earthquake of magnitude 4.4 on the Richter scale hit Campbell Bay, Andaman and Nicobar island on Monday, said the National Center for Seismology.",
    "The leader of banned organisation Sikhs for Justice has been named as the main accused in connection with the appearance of 'Khalistan' banners and graffiti on the walls of Himachal Pradesh Assembly in Dharamshala yesterday.",
    "Maharashtra Chief Minister Uddhav Thackeray has said that many attempts were made to destroy the Shiv Sena but they all proved futile.",
    "The renewed security measure comes after the banned outfit Sikhs For Justice (SFJ) announced that it will hold a 'Khalistan' referendum on June 6 in Himachal Pradesh.",
    "A former acting principal of a government girls college in Deoria district of Uttar Pradesh was arrested on Sunday for allegedly indulging in indecent acts with students, police said.",
    "A man in Ujjain has submitted a complaint to the police over the theft of his slippers saying he won't be responsible if someone places them at a crime scene."
]